Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/svd/PIC32CZ2051CA90208.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>MLB</name>
         <version>038091a0</version>
         <description>Media Local Bus</description>
         <groupName>MLB</groupName>
         <prependToName>MLB_</prependToName>
         <baseAddress>0x458C0000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x7E0</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>MLB_GENERAL</name>
            <value>218</value>
         </interrupt>
         <interrupt>
            <name>MLB_BUSREQ</name>
            <value>219</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>MLB Wrapper Control Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>MediaLB Enable (ON) bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run In Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTMLB</name>
                     <description>MLB General Interrupt Enable Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INT0AHB</name>
                     <description>AHB Interrupt 0 Enable Clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INT1AHB</name>
                     <description>AHB Interrupt 1 Enable Clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTMLB</name>
                     <description>MLB General Interrupt Enable Set</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INT0AHB</name>
                     <description>AHB Interrupt 0 Enable Set</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INT1AHB</name>
                     <description>AHB Interrupt 1 Enable Set</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Status and Clear Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTMLB</name>
                     <description>MLB General Interrupt Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INT0AHB</name>
                     <description>AHB Interrupt 0 Flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INT1AHB</name>
                     <description>AHB Interrupt 1 Flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug Control Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DBGRUN</name>
                     <description>Debug Run Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCBUSY</name>
               <description>SYNCBUSY Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Synchronization Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Module Enable Synchronization Busy</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MLBC0</name>
               <description>MediaLB Control 0 Register</description>
               <addressOffset>0x400</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MLBEN</name>
                     <description>MediaLB enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MLBCLK</name>
                     <description>MediaLB clock speed select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>MLBCLKSelect</name>
                        <enumeratedValue>
                           <name>256xFs</name>
                           <description>256x Frame Speed</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>512xFs</name>
                           <description>512x Frame Speed</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1024xFs</name>
                           <description>1024x Frame Speed</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MLBPEN</name>
                     <description>MediaLB 6-pin enable.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MLBLK</name>
                     <description>MediaLB lock status (read-only)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ASYRETRY</name>
                     <description>Asynchronous Tx packet retry</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTLRETRY</name>
                     <description>Control Tx packet retry</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCNT</name>
                     <description>Number of frames per sub-buffer (synchronous channels)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MS0</name>
               <description>MediaLB Channel Status 0 Register</description>
               <addressOffset>0x40C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MCS</name>
                     <description>MediaLB channel status (for channels 31 to 0)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MS1</name>
               <description>MediaLB Channel Status 1 Register</description>
               <addressOffset>0x414</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MCS</name>
                     <description>MediaLB channel status (for channels 63 to 32)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSS</name>
               <description>MediaLB System Status Register</description>
               <addressOffset>0x420</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RSTSYSCMD</name>
                     <description>Reset system command detected</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LKSYSCMD</name>
                     <description>Network lock system command detected</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ULKSYSCMD</name>
                     <description>Network unlock system command detected</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSSYSCMD</name>
                     <description>Channel scan system command detected</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWSYSCMD</name>
                     <description>Software system command detected</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERVREQ</name>
                     <description>Service request enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSD</name>
               <description>MediaLB System Data Register (Read-only)</description>
               <addressOffset>0x424</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SD0</name>
                     <description>System data (byte 0) - LSB</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SD1</name>
                     <description>System data (byte 1)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SD2</name>
                     <description>System data (byte 2)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SD3</name>
                     <description>System data (byte 3) - MSB</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MIEN</name>
               <description>MediaLB Interrupt Enable Register</description>
               <addressOffset>0x42C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ISOC_PE</name>
                     <description>Isochronous Rx protocol error enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISOC_BUFO</name>
                     <description>Isochronous Rx buffer overflow enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNC_PE</name>
                     <description>Synchronous protocol error enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARX_DONE</name>
                     <description>Asynchronous Rx packet done enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARX_PE</name>
                     <description>Asynchronous Rx protocol error enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARX_BREAK</name>
                     <description>Asynchronous Rx break enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ATX_DONE</name>
                     <description>Asynchronous Tx packet done enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ATX_PE</name>
                     <description>Asynchronous Tx protocol error enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ATX_BREAK</name>
                     <description>Asynchronous Tx break enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRX_DONE</name>
                     <description>Control Rx packet done enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRX_PE</name>
                     <description>Control Rx protocol error enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRX_BREAK</name>
                     <description>Control Rx break enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTX_DONE</name>
                     <description>Control Tx packet done enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTX_PE</name>
                     <description>Control Tx protocol error enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTX_BREAK</name>
                     <description>Control Tx break enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MLBC1</name>
               <description>MediaLB Control 1 Register</description>
               <addressOffset>0x43C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>MediaLB lock error status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKM</name>
                     <description>MediaLB clock missing status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NDA</name>
                     <description>Node device address</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCTL</name>
               <description>HBI Control Register</description>
               <addressOffset>0x480</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RST0</name>
                     <description>AGU0 software reset: 1 = reset active, 0 = reset inactive</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST1</name>
                     <description>AGU1 software reset: 1 = reset active, 0 = reset inactive</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>HBI enable: 1 = enabled, 0 = disabled</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCMR0</name>
               <description>HBI Channel Mask 0 Register</description>
               <addressOffset>0x488</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHM</name>
                     <description>Bitwise channel mask bit: 0 = masked, 1 = unmasked</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCMR1</name>
               <description>HBI Channel Mask 1 Register</description>
               <addressOffset>0x48C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHM</name>
                     <description>Bitwise channel mask bit: 0 = masked, 1 = unmasked</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCER0</name>
               <description>HBI Channel Error 0 Register</description>
               <addressOffset>0x490</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CERR</name>
                     <description>Bitwise channel error bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCER1</name>
               <description>HBI Channel Error 1 Register</description>
               <addressOffset>0x494</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CERR</name>
                     <description>Bitwise channel error bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCBR0</name>
               <description>HBI Channel Busy 0 Register</description>
               <addressOffset>0x498</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHB</name>
                     <description>Bitwise channel busy bit: 0 = idle, 1 = busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
