Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/svd/PIC32CZ2051CA90208.svd
            <register>
               <name>PLL0POSTDIVA</name>
               <description>PLL output clock divider A</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <resetValue>0x20202020</resetValue>
               <fields>
                  <field>
                     <name>POSTDIV0</name>
                     <description>PLL output 0 clock division factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>OUTEN0</name>
                     <description>PLL output 0 enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POSTDIV1</name>
                     <description>PLL output 0 clock division factor</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>OUTEN1</name>
                     <description>PLL output 0 enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POSTDIV2</name>
                     <description>PLL output 0 clock division factor</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>OUTEN2</name>
                     <description>PLL output 0 enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POSTDIV3</name>
                     <description>PLL output 0 clock division factor</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>OUTEN3</name>
                     <description>PLL output 0 enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLL1CTRL</name>
               <description>PLL Control</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>PLL Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRTLOCK</name>
                     <description>Write Lock</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REFSEL</name>
                     <description>Reference selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>REFSELSelect</name>
                        <enumeratedValue>
                           <name>GCLK</name>
                           <description>Dedicated GCLK clock reference</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XOSC</name>
                           <description>XOSC clock reference</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DFLL48M</name>
                           <description>DFLL48M clock reference</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BWSEL</name>
                     <description>Bandwidth selection</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>BWSELSelect</name>
                        <enumeratedValue>
                           <name>BWSEL0</name>
                           <description>TBD</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BWSEL1</name>
                           <description>TBD</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BWSEL2</name>
                           <description>TBD</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BWSEL3</name>
                           <description>TBD</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BWSEL4</name>
                           <description>TBD</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BWSEL5</name>
                           <description>TBD</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BWSEL6</name>
                           <description>TBD</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BWSEL7</name>
                           <description>TBD</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLL1FBDIV</name>
               <description>PLL Feed-Back Divider</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FBDIV</name>
                     <description>PLL Feed-Back Divider Factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLL1REFDIV</name>
               <description>PLL reference divider</description>
               <addressOffset>0x5C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REFDIV</name>
                     <description>PLL reference division factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLL1POSTDIVA</name>
               <description>PLL output clock divider A</description>
               <addressOffset>0x60</addressOffset>
               <size>32</size>
               <resetValue>0x20202020</resetValue>
               <fields>
                  <field>
                     <name>POSTDIV0</name>
                     <description>PLL output 0 clock division factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>OUTEN0</name>
                     <description>PLL output 0 enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POSTDIV1</name>
                     <description>PLL output 0 clock division factor</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>OUTEN1</name>
                     <description>PLL output 0 enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POSTDIV2</name>
                     <description>PLL output 0 clock division factor</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>OUTEN2</name>
                     <description>PLL output 0 enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POSTDIV3</name>
                     <description>PLL output 0 clock division factor</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>OUTEN3</name>
                     <description>PLL output 0 enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FRACDIV0</name>
               <description>Fractional Divider</description>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <resetValue>0x00200000</resetValue>
               <fields>
                  <field>
                     <name>REMDIV</name>
                     <description>Frequency division factor reminder part</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>INTDIV</name>
                     <description>Frequency division factor integer part</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FRACDIV1</name>
               <description>Fractional Divider</description>
               <addressOffset>0x74</addressOffset>
               <size>32</size>
               <resetValue>0x00200000</resetValue>
               <fields>
                  <field>
                     <name>REMDIV</name>
                     <description>Frequency division factor reminder part</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>INTDIV</name>
                     <description>Frequency division factor integer part</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCBUSY</name>
               <description>Synchronization Busy</description>
               <addressOffset>0x78</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DFLLENABLE</name>
                     <description>DFLL48M ENABLE Synchronization Busy</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLCTRLB</name>
                     <description>DFLLCTRLB Synchronization Busy</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLTUNE</name>
                     <description>DFLLTUNE Synchronization Busy</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLDIFF</name>
                     <description>DFLLDIFF Synchronization Busy</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLMUL</name>
                     <description>DFLLMUL Synchronization Busy</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRACDIV0</name>
                     <description>FRACDIV0 Synchronization Busy</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRACDIV1</name>
                     <description>FRACDIV1 Synchronization Busy</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>XOSCCAL</name>
               <description>XOSC Calibration Register</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CAL</name>
                     <description>XOSC Calibration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_MODE</name>
               <description>XOSC Calibration Register</description>
               <alternateRegister>XOSCCAL</alternateRegister>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FTRANS</name>
                     <description>Fine Transconductance programmability for Oscillator</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>KICKEREN</name>
                     <description>Kicker enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENVAMP</name>
                     <description>envelope amplitude at osci</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>loop hysteresis control</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMSEL</name>
                     <description>clock buffer common mode selection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLIPPOL</name>
                     <description>flip output clock polarity</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REDGAIN</name>
                     <description>reduce gain control timer</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REDOSC</name>
                     <description>reduce oscillation debug counter</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPARES</name>
                     <description>Spare bits</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RC48MCAL0</name>
               <description>RC48M Calibration 0</description>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CAL</name>
                     <description>RC48M Calibration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RC48MCAL0_FUSES_OSC_RC48MHZ_V1_MODE</name>
               <description>RC48M Calibration 0</description>
               <alternateRegister>RC48MCAL0</alternateRegister>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>temp_trim_mv</name>
                     <description>Temp trim value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>proc_trim_mv</name>
                     <description>Proc trim value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>iosc_boost</name>
                     <description>IOSC boost</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>out_buf_sel</name>
                     <description>Output buffer select</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ldo_vout_boost</name>
                     <description>LDO VOUT boost</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>cmp_8m_lp</name>
                     <description>Comparator 8MHz low-power</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>cmp_pwr_ctrl</name>
                     <description>Comparator power control</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
