Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/svd/PIC32CZ2051CA90208.svd
               <register>
                  <name>RXFIFOSZ</name>
                  <description>Controls The Size Of The Selected RX Endpoint FIFO</description>
                  <addressOffset>0x1063</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SZ</name>
                        <description>maximum packet size to be allowed</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>SZSelect</name>
                           <enumeratedValue>
                              <name>8BYTES</name>
                              <description>8 BYTES</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>16BYTES</name>
                              <description>16 BYTES</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>32BYTES</name>
                              <description>32 BYTES</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>64BYTES</name>
                              <description>64 BYTES</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>128BYTES</name>
                              <description>128 BYTES</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>256BYTES</name>
                              <description>256 BYTES</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>512BYTES</name>
                              <description>512 BYTES</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1024BYTES</name>
                              <description>1024 BYTES</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>2048BYTES</name>
                              <description>2048 BYTES</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>4096BYTES</name>
                              <description>4096 BYTES</description>
                              <value>0x9</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DPB</name>
                        <description>double packet buffering enabled or not</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TXFIFOADD</name>
                  <description>Controls The Start Address Of the Selected TX Endpoint FIFO</description>
                  <addressOffset>0x1064</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>start address of the endpoint FIFO</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>13</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RXFIFOADD</name>
                  <description>Controls The Start Address Of the Selected RX Endpoint FIFO</description>
                  <addressOffset>0x1066</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>start address of the endpoint FIFO</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>13</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EPINFO</name>
                  <description>Allows Read-Back Of The Number Of TX And RX Endpoints</description>
                  <addressOffset>0x1078</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0xFF</resetValue>
                  <fields>
                     <field>
                        <name>TXENDPOINTS</name>
                        <description>number of tx endpoints</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>RXENDPOINTS</name>
                        <description>number of rx endpoints</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RAMINFO</name>
                  <description>Details About Width Of RAM and DMA Channels</description>
                  <addressOffset>0x1079</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x8D</resetValue>
                  <fields>
                     <field>
                        <name>RAMBITS</name>
                        <description>width of the ram address bus</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>DMACHANS</name>
                        <description>number of dma channels implemented in the design</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LINKINFO</name>
                  <description>Allows Some Delays To Be Specified</description>
                  <addressOffset>0x107A</addressOffset>
                  <size>8</size>
                  <resetValue>0x5C</resetValue>
                  <fields>
                     <field>
                        <name>WTID</name>
                        <description>sets the delay to be applied from idpullup being asserted to iddig being considered valid in units of 4.369ms</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>WTCON</name>
                        <description>sets the wait to be applied to allow for the user's connect/disconnect filter in units of 533.3ns</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>VPLEN</name>
                  <description>Sets The Duration Of The VBus Pulsing Charge</description>
                  <addressOffset>0x107B</addressOffset>
                  <size>8</size>
                  <resetValue>0x3C</resetValue>
                  <fields>
                     <field>
                        <name>VPLEN</name>
                        <description>duration of VBus pulsing charge in units of 546.1us</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSEOF1</name>
                  <description>Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For HS Transactions</description>
                  <addressOffset>0x107C</addressOffset>
                  <size>8</size>
                  <resetValue>0x80</resetValue>
                  <fields>
                     <field>
                        <name>HSEOF1</name>
                        <description>sets for high-speed transactions the time before eof to stop beginning new transactions, in units of 133.3ns. (the default setting corresponds to 17.07us.)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FSEOF1</name>
                  <description>Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For FS Transactions</description>
                  <addressOffset>0x107D</addressOffset>
                  <size>8</size>
                  <resetValue>0x77</resetValue>
                  <fields>
                     <field>
                        <name>FSEOF1</name>
                        <description>sets for full-speed transactions the time before eof to stop beginning new transactions, in units of 533.3ns. (the default setting corresponds to 63.46us.)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LSEOF1</name>
                  <description>Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For LS Transactions</description>
                  <addressOffset>0x107E</addressOffset>
                  <size>8</size>
                  <resetValue>0x72</resetValue>
                  <fields>
                     <field>
                        <name>LSEOF1</name>
                        <description>sets for low-speed transactions the time before eof to stop beginning new transactions, in units of 1.067us. (the default setting corresponds to 121.6us.)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SOFTRST</name>
                  <description>Assert Low The Output Reset Signals NRSTO and NRSTXO</description>
                  <addressOffset>0x107F</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>NRST</name>
                        <description>when a 1 is written to this bit, the output nrsto will be asserted (low) within a minimum delay of 7 cycles of the clk input. the output nrsto will be asynchronously asserted and synchronously de-asserted with respect to clk.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NRSTX</name>
                        <description>when a 1 is written to this bit, the output nrstxo will be asserted (low) within a minimum delay of 7 cycles of the clk input. the output nrstxo will be asynchronously asserted and synchronously de-asserted with respect to xclk.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <cluster>
                  <dim>8</dim>
                  <dimIncrement>0x8</dimIncrement>
                  <name>TXFUNADDR[%s]</name>
                  <description/>
                  <addressOffset>0x1080</addressOffset>
                  <register>
                     <name>TXFUNCADDREP</name>
                     <description>Relevant In Host Mode Only. Address Of The Target Function.</description>
                     <addressOffset>0x0</addressOffset>
                     <size>8</size>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>TXFUNCADDR</name>
                           <description>address of the target function</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>7</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>TXHUBADDREP</name>
                     <description>Relevant In Host Mode Only. HUB Address</description>
                     <addressOffset>0x2</addressOffset>
                     <size>8</size>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>TXHUBADDR</name>
                           <description>hub address</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>7</bitWidth>
                        </field>
                        <field>
                           <name>MULTRANS</name>
                           <description>hub has multiple or single translator</description>
                           <bitOffset>7</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>TXHUBPORT</name>
                     <description>Relevant In Host Mode Only. HUB Address</description>
                     <addressOffset>0x3</addressOffset>
                     <size>8</size>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>HUBPORT</name>
                           <description>Hub Port</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>7</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>RXFUNCADDREP</name>
                     <description>Relevant In Host Mode Only. Address Of The Target Function.</description>
                     <addressOffset>0x4</addressOffset>
                     <size>8</size>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>RXFUNCADDR</name>
                           <description>address of the target function</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>7</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>RXHUBADDREP</name>
                     <description>Relevant In Host Mode Only. HUB Address</description>
                     <addressOffset>0x6</addressOffset>
                     <size>8</size>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>RXHUBADDR</name>
                           <description>hub address</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>7</bitWidth>
                        </field>
                        <field>
                           <name>MULTRANS</name>
                           <description>hub has multiple or single translator</description>
                           <bitOffset>7</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>RXHUBPORT</name>
                     <description>Relevant In Host Mode Only. HUB Address</description>
                     <addressOffset>0x7</addressOffset>
                     <size>8</size>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>HUBPORT</name>
                           <description>Hub Port</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>7</bitWidth>
                        </field>
                     </fields>
                  </register>
               </cluster>
               <register>
                  <name>DMAINTR</name>
                  <description>DMA Interrupt Status for Each Channel</description>
                  <addressOffset>0x1200</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DMAINTR</name>
                        <description>DMA Interrupt for each channel</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <cluster>
                  <dim>8</dim>
                  <dimIncrement>0x10</dimIncrement>
                  <name>DMACNT[%s]</name>
                  <description/>
                  <addressOffset>0x1204</addressOffset>
                  <register>
                     <name>DMACNTL</name>
                     <description>DMA Transfer Control For Each Channel</description>
                     <addressOffset>0x0</addressOffset>
                     <size>32</size>
                     <resetValue>0x00000000</resetValue>
                     <fields>
                        <field>
                           <name>DMAEN</name>
                           <description>dma transfer enable</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>DMADIR</name>
                           <description>transfer direction</description>
                           <bitOffset>1</bitOffset>
                           <bitWidth>1</bitWidth>
                           <enumeratedValues>
                              <name>DMADIRSelect</name>
                              <enumeratedValue>
                                 <name>WRITE</name>
                                 <description>DMA Write (RX Endpoint)</description>
                                 <value>0x0</value>
                              </enumeratedValue>
                              <enumeratedValue>
                                 <name>READ</name>
                                 <description>DMA Read (TX Endpoint)</description>
                                 <value>0x1</value>
                              </enumeratedValue>
                           </enumeratedValues>
                        </field>
                        <field>
                           <name>DMAMODE</name>
                           <description>transfer mode</description>
                           <bitOffset>2</bitOffset>
                           <bitWidth>1</bitWidth>
                           <enumeratedValues>
                              <name>DMAMODESelect</name>
                              <enumeratedValue>
                                 <name>MODE0</name>
                                 <description>Mode 0 Transfer</description>
                                 <value>0x0</value>
                              </enumeratedValue>
                              <enumeratedValue>
                                 <name>MODE1</name>
                                 <description>Mode1 Transfer</description>
                                 <value>0x1</value>
                              </enumeratedValue>
                           </enumeratedValues>
                        </field>
                        <field>
                           <name>DMAIE</name>
                           <description>interrupt enable</description>
                           <bitOffset>3</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>DMAEP</name>
                           <description>endpoint number this channel is assigned to</description>
                           <bitOffset>4</bitOffset>
                           <bitWidth>4</bitWidth>
                        </field>
                        <field>
                           <name>DMAERR</name>
                           <description>bus error bit</description>
                           <bitOffset>8</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>DMABRSTM</name>
                           <description>burst mode</description>
                           <bitOffset>9</bitOffset>
                           <bitWidth>2</bitWidth>
                           <enumeratedValues>
                              <name>DMABRSTMSelect</name>
                              <enumeratedValue>
                                 <name>BM0</name>
                                 <description>Burst Mode 0</description>
                                 <value>0x0</value>
                              </enumeratedValue>
                              <enumeratedValue>
                                 <name>BM1</name>
                                 <description>Burst Mode 1</description>
                                 <value>0x1</value>
                              </enumeratedValue>
                              <enumeratedValue>
                                 <name>BM2</name>
                                 <description>Burst Mode 2</description>
                                 <value>0x2</value>
                              </enumeratedValue>
                              <enumeratedValue>
                                 <name>BM3</name>
                                 <description>Burst Mode 3</description>
                                 <value>0x3</value>
                              </enumeratedValue>
                           </enumeratedValues>
                        </field>
                     </fields>
                  </register>
